<?php
<<<<<<< HEAD
$lang['required']           = "ÐŸÐ¾Ð»Ðµ '%s' Ð¾Ð±ÑÐ·Ð°Ñ‚ÐµÐ»ÑŒÐ½Ð¾ Ð´Ð»Ñ Ð·Ð°Ð¿Ð¾Ð»Ð½ÐµÐ½Ð¸Ñ.";
$lang['isset']              = "ÐŸÐ¾Ð»Ðµ '%s' Ð½Ðµ Ð´Ð¾Ð»Ð¶Ð½Ð¾ Ð±Ñ‹Ñ‚ÑŒ Ð¿ÑƒÑÑ‚Ñ‹Ð¼.";
$lang['valid_email']        = "ÐŸÐ¾Ð»Ðµ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð¾ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ð¿Ñ€Ð°Ð²Ð¸Ð»ÑŒÐ½Ñ‹Ð¹ Ð¿Ð¾Ñ‡Ñ‚Ð¾Ð²Ñ‹Ð¹ Ð°Ð´Ñ€ÐµÑ.";
$lang['valid_emails']       = "ÐŸÐ¾Ð»Ðµ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð¾ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ð¿Ñ€Ð°Ð²Ð¸Ð»ÑŒÐ½Ñ‹Ðµ Ð¿Ð¾Ñ‡Ñ‚Ð¾Ð²Ñ‹Ðµ Ð°Ð´Ñ€ÐµÑÐ°.";
$lang['valid_url']          = "ÐŸÐ¾Ð»Ðµ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð¾ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ð¿Ñ€Ð°Ð²Ð¸Ð»ÑŒÐ½Ñ‹Ð¹ URL.";
$lang['valid_ip']           = "ÐŸÐ¾Ð»Ðµ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð¾ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ð¿Ñ€Ð°Ð²Ð¸Ð»ÑŒÐ½Ñ‹Ð¹ IP.";
$lang['min_length']         = "Ð”Ð»Ð¸Ð½Ð° Ð¿Ð¾Ð»Ñ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð° Ð±Ñ‹Ñ‚ÑŒ Ð½Ðµ Ð¼ÐµÐ½ÐµÐµ %s ÑÐ¸Ð¼Ð²Ð¾Ð»Ð¾Ð².";
$lang['max_length']         = "Ð”Ð»Ð¸Ð½Ð° Ð¿Ð¾Ð»Ñ '%s' Ð½Ðµ Ð´Ð¾Ð»Ð¶Ð½Ð° Ð¿Ñ€ÐµÐ²Ñ‹ÑˆÐ°Ñ‚ÑŒ %s ÑÐ¸Ð¼Ð²Ð¾Ð»Ð¾Ð².";
$lang['exact_length']       = "Ð”Ð»Ð¸Ð½Ð° Ð¿Ð¾Ð»Ñ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð° Ð±Ñ‹Ñ‚ÑŒ Ñ€Ð°Ð²Ð½Ð° %s ÑÐ¸Ð¼Ð²Ð¾Ð»Ð°Ð¼.";
$lang['alpha']              = "ÐŸÐ¾Ð»Ðµ '%s' Ð¼Ð¾Ð¶ÐµÑ‚ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ñ‚Ð¾Ð»ÑŒÐºÐ¾ Ð»Ð°Ñ‚Ð¸Ð½ÑÐºÐ¸Ðµ Ð±ÑƒÐºÐ²Ñ‹.";
$lang['alpha_numeric']      = "ÐŸÐ¾Ð»Ðµ '%s' Ð¼Ð¾Ð¶ÐµÑ‚ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ñ‚Ð¾Ð»ÑŒÐºÐ¾ Ð»Ð°Ñ‚Ð¸Ð½ÑÐºÐ¸Ðµ Ð±ÑƒÐºÐ²Ñ‹ Ð¸ Ñ†Ð¸Ñ„Ñ€Ñ‹.";
$lang['alpha_dash']         = "ÐŸÐ¾Ð»Ðµ '%s' Ð¼Ð¾Ð¶ÐµÑ‚ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ñ‚Ð¾Ð»ÑŒÐºÐ¾ Ð»Ð°Ñ‚Ð¸Ð½ÑÐºÐ¸Ðµ Ð±ÑƒÐºÐ²Ñ‹, Ñ†Ð¸Ñ„Ñ€Ñ‹, Ð¿Ð¾Ð´Ñ‡ÐµÑ€ÐºÐ¸Ð²Ð°Ð½Ð¸Ñ Ð¸ Ñ‚Ð¸Ñ€Ðµ.";
$lang['numeric']            = "ÐŸÐ¾Ð»Ðµ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð¾ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ñ‚Ð¾Ð»ÑŒÐºÐ¾ Ñ‡Ð¸ÑÐ»Ð°.";
$lang['is_numeric']         = "ÐŸÐ¾Ð»Ðµ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð¾ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ñ‚Ð¾Ð»ÑŒÐºÐ¾ Ñ†Ð¸Ñ„Ñ€Ñ‹.";
$lang['integer']            = "ÐŸÐ¾Ð»Ðµ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð¾ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ñ†ÐµÐ»Ð¾Ðµ Ñ‡Ð¸ÑÐ»Ð¾.";
$lang['matches']            = "Ð—Ð½Ð°Ñ‡ÐµÐ½Ð¸Ðµ '%s' Ð½Ðµ ÑÐ¾Ð²Ð¿Ð°Ð´Ð°ÐµÑ‚ ÑÐ¾ Ð·Ð½Ð°Ñ‡ÐµÐ½Ð¸ÐµÐ¼ %s.";
$lang['is_natural']         = "ÐŸÐ¾Ð»Ðµ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð¾ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ñ‚Ð¾Ð»ÑŒÐºÐ¾ Ð¿Ð¾Ð»Ð¾Ð¶Ð¸Ñ‚ÐµÐ»ÑŒÐ½Ñ‹Ðµ Ñ‡Ð¸ÑÐ»Ð°.";
$lang['is_natural_no_zero'] = "ÐŸÐ¾Ð»Ðµ '%s' Ð´Ð¾Ð»Ð¶Ð½Ð¾ ÑÐ¾Ð´ÐµÑ€Ð¶Ð°Ñ‚ÑŒ Ñ‚Ð¾Ð»ÑŒÐºÐ¾ Ð¿Ð¾Ð»Ð¾Ð¶Ð¸Ñ‚ÐµÐ»ÑŒÐ½Ñ‹Ðµ Ñ‡Ð¸ÑÐ»Ð°.";
=======
$lang['required']           = "Ïîëå '%s' îáÿçàòåëüíî äëÿ çàïîëíåíèÿ.";
$lang['isset']              = "Ïîëå '%s' íå äîëæíî áûòü ïóñòûì.";
$lang['valid_email']        = "Ïîëå '%s' äîëæíî ñîäåðæàòü ïðàâèëüíûé ïî÷òîâûé àäðåñ.";
$lang['valid_emails']       = "Ïîëå '%s' äîëæíî ñîäåðæàòü ïðàâèëüíûå ïî÷òîâûå àäðåñà.";
$lang['valid_url']          = "Ïîëå '%s' äîëæíî ñîäåðæàòü ïðàâèëüíûé URL.";
$lang['valid_ip']           = "Ïîëå '%s' äîëæíî ñîäåðæàòü ïðàâèëüíûé IP.";
$lang['min_length']         = "Äëèíà ïîëÿ '%s' äîëæíà áûòü íå ìåíåå %s ñèìâîëîâ.";
$lang['max_length']         = "Äëèíà ïîëÿ '%s' íå äîëæíà ïðåâûøàòü %s ñèìâîëîâ.";
$lang['exact_length']       = "Äëèíà ïîëÿ '%s' äîëæíà áûòü ðàâíà %s ñèìâîëàì.";
$lang['alpha']              = "Ïîëå '%s' ìîæåò ñîäåðæàòü òîëüêî ëàòèíñêèå áóêâû.";
$lang['alpha_numeric']      = "Ïîëå '%s' ìîæåò ñîäåðæàòü òîëüêî ëàòèíñêèå áóêâû è öèôðû.";
$lang['alpha_dash']         = "Ïîëå '%s' ìîæåò ñîäåðæàòü òîëüêî ëàòèíñêèå áóêâû, öèôðû, ïîä÷åðêèâàíèÿ è òèðå.";
$lang['numeric']            = "Ïîëå '%s' äîëæíî ñîäåðæàòü òîëüêî ÷èñëà.";
$lang['is_numeric']         = "Ïîëå '%s' äîëæíî ñîäåðæàòü òîëüêî öèôðû.";
$lang['integer']            = "Ïîëå '%s' äîëæíî ñîäåðæàòü öåëîå ÷èñëî.";
$lang['matches']            = "Çíà÷åíèå '%s' íå ñîâïàäàåò ñî çíà÷åíèåì %s.";
$lang['is_natural']         = "Ïîëå '%s' äîëæíî ñîäåðæàòü òîëüêî ïîëîæèòåëüíûå ÷èñëà.";
$lang['is_natural_no_zero'] = "Ïîëå '%s' äîëæíî ñîäåðæàòü òîëüêî ïîëîæèòåëüíûå ÷èñëà.";
>>>>>>> d7c19a200a2d68b9025e17ce4a23b1e0fa4c76ff
