<?php
<<<<<<< HEAD
$lang['upload_userfile_not_set'] = 'ÐÐµÐ²Ð¾Ð·Ð¼Ð¾Ð¶Ð½Ð¾ Ð½Ð°Ð¹Ñ‚Ð¸ Ð¿ÐµÑ€ÐµÐ¼ÐµÐ½Ð½ÑƒÑŽ userfile Ð² Ð´Ð°Ð½Ð½Ñ‹Ñ… POST.';
$lang['upload_file_exceeds_limit'] = 'Ð—Ð°Ð³Ñ€ÑƒÐ¶Ð°ÐµÐ¼Ñ‹Ð¹ Ñ„Ð°Ð¹Ð» Ð¿Ñ€ÐµÐ²Ñ‹ÑˆÐ°ÐµÑ‚ Ð¼Ð°ÐºÑÐ¸Ð¼Ð°Ð»ÑŒÐ½Ð¾ Ð´Ð¾Ð¿ÑƒÑÑ‚Ð¸Ð¼Ñ‹Ð¹ Ñ€Ð°Ð·Ð¼ÐµÑ€, Ð¾Ð¿Ñ€ÐµÐ´ÐµÐ»Ñ‘Ð½Ð½Ñ‹Ð¹ Ð² Ð²Ð°ÑˆÐµÐ¼ Ñ„Ð°Ð¹Ð»Ðµ ÐºÐ¾Ð½Ñ„Ð¸Ð³ÑƒÑ€Ð°Ñ†Ð¸Ð¸ PHP.';
$lang['upload_file_exceeds_form_limit'] = 'Ð—Ð°Ð³Ñ€ÑƒÐ¶Ð°ÐµÐ¼Ñ‹Ð¹ Ñ„Ð°Ð¹Ð» Ð¿Ñ€ÐµÐ²Ñ‹ÑˆÐ°ÐµÑ‚ Ð¼Ð°ÐºÑÐ¸Ð¼Ð°Ð»ÑŒÐ½Ð¾ Ð´Ð¾Ð¿ÑƒÑÑ‚Ð¸Ð¼Ñ‹Ð¹ Ñ€Ð°Ð·Ð¼ÐµÑ€, Ð·Ð°Ð´Ð°Ð½Ð½Ñ‹Ð¹ Ñ„Ð¾Ñ€Ð¼Ð¾Ð¹.';
$lang['upload_file_partial'] = 'Ð­Ñ‚Ð¾Ñ‚ Ñ„Ð°Ð¹Ð» Ð±Ñ‹Ð» Ð·Ð°Ð³Ñ€ÑƒÐ¶ÐµÐ½ Ð½Ðµ Ð¿Ð¾Ð»Ð½Ð¾ÑÑ‚ÑŒÑŽ.';
$lang['upload_no_temp_directory'] = 'Ð’Ñ€ÐµÐ¼ÐµÐ½Ð½Ð°Ñ Ð´Ð¸Ñ€ÐµÐºÑ‚Ð¾Ñ€Ð¸Ñ Ð½Ðµ Ð½Ð°Ð¹Ð´ÐµÐ½Ð°.';
$lang['upload_unable_to_write_file'] = 'Ð¤Ð°Ð¹Ð» Ð½Ðµ Ð¼Ð¾Ð¶ÐµÑ‚ Ð±Ñ‹Ñ‚ÑŒ Ð·Ð°Ð¿Ð¸ÑÐ°Ð½ Ð½Ð° Ð´Ð¸ÑÐº.';
$lang['upload_stopped_by_extension'] = 'ÐÐµÐ²ÐµÑ€Ð½Ñ‹Ð¹ Ñ„Ð¾Ñ€Ð¼Ð°Ñ‚ Ñ„Ð°Ð¹Ð»Ð°.';
$lang['upload_no_file_selected'] = 'Ð’Ñ‹ Ð½Ðµ Ð²Ñ‹Ð±Ñ€Ð°Ð»Ð¸ Ñ„Ð°Ð¹Ð» Ð´Ð»Ñ Ð·Ð°Ð³Ñ€ÑƒÐ·ÐºÐ¸.';
$lang['upload_invalid_filetype'] = 'Ð’Ñ‹ Ð¿Ñ‹Ñ‚Ð°ÐµÑ‚ÐµÑÑŒ Ð·Ð°Ð³Ñ€ÑƒÐ·Ð¸Ñ‚ÑŒ Ð·Ð°Ð¿Ñ€ÐµÑ‰ÐµÐ½Ð½Ñ‹Ð¹ Ñ‚Ð¸Ð¿ Ñ„Ð°Ð¹Ð»Ð°.';
$lang['upload_invalid_filesize'] = 'Ð—Ð°Ð³Ñ€ÑƒÐ¶Ð°ÐµÐ¼Ñ‹Ð¹ Ñ„Ð°Ð¹Ð» Ð¿Ñ€ÐµÐ²Ñ‹ÑˆÐ°ÐµÑ‚ Ð¾Ð³Ñ€Ð°Ð½Ð¸Ñ‡ÐµÐ½Ð¸Ðµ Ð² Ñ€Ð°Ð·Ð¼ÐµÑ€Ðµ.';
$lang['upload_invalid_dimensions'] = 'Ð—Ð°Ð³Ñ€ÑƒÐ¶Ð°ÐµÐ¼Ð¾Ðµ Ð¸Ð·Ð¾Ð±Ñ€Ð°Ð¶ÐµÐ½Ð¸Ðµ Ð¿Ñ€ÐµÐ²Ñ‹ÑˆÐ°ÐµÑ‚ Ð´Ð¾Ð¿ÑƒÑÑ‚Ð¸Ð¼Ñ‹Ðµ ÑˆÐ¸Ñ€Ð¸Ð½Ñƒ Ð¸Ð»Ð¸ Ð²Ñ‹ÑÐ¾Ñ‚Ñƒ.';
$lang['upload_destination_error'] = 'ÐÐµÐ²Ð¾Ð·Ð¼Ð¾Ð¶Ð½Ð¾ ÑÐºÐ¾Ð¿Ð¸Ñ€Ð¾Ð²Ð°Ñ‚ÑŒ Ñ„Ð°Ð¹Ð» Ð² ÑƒÐºÐ°Ð·Ð°Ð½Ð½Ð¾Ðµ Ð¼ÐµÑÑ‚Ð¾ Ð¿Ð¾ÑÐ»Ðµ ÐµÐ³Ð¾ Ð·Ð°Ð³Ñ€ÑƒÐ·ÐºÐ¸.';
$lang['upload_no_filepath'] = 'ÐŸÑƒÑ‚ÑŒ Ð´Ð»Ñ Ð·Ð°Ð³Ñ€ÑƒÐ·ÐºÐ¸ Ñ„Ð°Ð¹Ð»Ð¾Ð² Ð½ÐµÐºÐ¾Ñ€Ñ€ÐµÐºÑ‚ÐµÐ½.';
$lang['upload_no_file_types'] = 'Ð’Ñ‹ Ð½Ðµ ÑƒÐºÐ°Ð·Ð°Ð»Ð¸ Ñ€Ð°Ð·Ñ€ÐµÑˆÑ‘Ð½Ð½Ñ‹Ðµ Ñ‚Ð¸Ð¿Ñ‹ Ñ„Ð°Ð¹Ð»Ð¾Ð².';
$lang['upload_bad_filename'] = 'Ð¤Ð°Ð¹Ð», ÐºÐ¾Ñ‚Ð¾Ñ€Ñ‹Ð¹ Ð²Ñ‹ Ð·Ð°Ð³Ñ€ÑƒÐ¶Ð°ÐµÑ‚Ðµ ÑƒÐ¶Ðµ Ð½Ð°Ñ…Ð¾Ð´Ð¸Ñ‚ÑÑ Ð½Ð° ÑÐµÑ€Ð²ÐµÑ€Ðµ.';
$lang['upload_not_writable'] = 'Ð”Ð¸Ñ€ÐµÐºÑ‚Ð¾Ñ€Ð¸Ñ, Ð² ÐºÐ¾Ñ‚Ð¾Ñ€ÑƒÑŽ Ð·Ð°Ð³Ñ€ÑƒÐ¶Ð°ÐµÑ‚ÑÑ Ñ„Ð°Ð¹Ð» Ð½Ðµ Ð¸Ð¼ÐµÐµÑ‚ Ð¿Ñ€Ð°Ð² Ð½Ð° Ð·Ð°Ð¿Ð¸ÑÑŒ.';
=======
$lang['upload_userfile_not_set'] = 'Íåâîçìîæíî íàéòè ïåðåìåííóþ userfile â äàííûõ POST.';
$lang['upload_file_exceeds_limit'] = 'Çàãðóæàåìûé ôàéë ïðåâûøàåò ìàêñèìàëüíî äîïóñòèìûé ðàçìåð, îïðåäåë¸ííûé â âàøåì ôàéëå êîíôèãóðàöèè PHP.';
$lang['upload_file_exceeds_form_limit'] = 'Çàãðóæàåìûé ôàéë ïðåâûøàåò ìàêñèìàëüíî äîïóñòèìûé ðàçìåð, çàäàííûé ôîðìîé.';
$lang['upload_file_partial'] = 'Ýòîò ôàéë áûë çàãðóæåí íå ïîëíîñòüþ.';
$lang['upload_no_temp_directory'] = 'Âðåìåííàÿ äèðåêòîðèÿ íå íàéäåíà.';
$lang['upload_unable_to_write_file'] = 'Ôàéë íå ìîæåò áûòü çàïèñàí íà äèñê.';
$lang['upload_stopped_by_extension'] = 'Íåâåðíûé ôîðìàò ôàéëà.';
$lang['upload_no_file_selected'] = 'Âû íå âûáðàëè ôàéë äëÿ çàãðóçêè.';
$lang['upload_invalid_filetype'] = 'Âû ïûòàåòåñü çàãðóçèòü çàïðåùåííûé òèï ôàéëà.';
$lang['upload_invalid_filesize'] = 'Çàãðóæàåìûé ôàéë ïðåâûøàåò îãðàíè÷åíèå â ðàçìåðå.';
$lang['upload_invalid_dimensions'] = 'Çàãðóæàåìîå èçîáðàæåíèå ïðåâûøàåò äîïóñòèìûå øèðèíó èëè âûñîòó.';
$lang['upload_destination_error'] = 'Íåâîçìîæíî ñêîïèðîâàòü ôàéë â óêàçàííîå ìåñòî ïîñëå åãî çàãðóçêè.';
$lang['upload_no_filepath'] = 'Ïóòü äëÿ çàãðóçêè ôàéëîâ íåêîððåêòåí.';
$lang['upload_no_file_types'] = 'Âû íå óêàçàëè ðàçðåø¸ííûå òèïû ôàéëîâ.';
$lang['upload_bad_filename'] = 'Ôàéë, êîòîðûé âû çàãðóæàåòå óæå íàõîäèòñÿ íà ñåðâåðå.';
$lang['upload_not_writable'] = 'Äèðåêòîðèÿ, â êîòîðóþ çàãðóæàåòñÿ ôàéë íå èìååò ïðàâ íà çàïèñü.';
>>>>>>> d7c19a200a2d68b9025e17ce4a23b1e0fa4c76ff
