-- phpMyAdmin SQL Dump
-- version 3.2.4
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Июл 01 2011 г., 16:36
-- Версия сервера: 5.1.41
-- Версия PHP: 5.3.1

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `users_accounts_zieit`
--
CREATE DATABASE `users_accounts_zieit` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `users_accounts_zieit`;

-- --------------------------------------------------------

--
-- Структура таблицы `accounts`
--

CREATE TABLE IF NOT EXISTS `accounts` (
  `id_account` int(11) NOT NULL AUTO_INCREMENT,
  `number_pass` int(7) NOT NULL,
  `id_status` int(3) NOT NULL,
  `id_samba_group` int(3) NOT NULL,
  `id_user_group` int(5) NOT NULL,
  `deleted` tinyint(1) NOT NULL DEFAULT '0',
  `blocked` enum('Да','Нет') NOT NULL DEFAULT 'Нет',
  `internet_lock` enum('Полный доступ','Нормальный доступ','Заблокированный') NOT NULL DEFAULT 'Нормальный доступ',
  `access_to_database` enum('Полный доступ','Нормальный доступ','Расширеный доступ','Заблокированный') NOT NULL DEFAULT 'Нормальный доступ',
  `account_name` varchar(255) NOT NULL,
  `login` varchar(255) NOT NULL,
  `password` varchar(32) NOT NULL,
  `picture` varchar(255) NOT NULL,
  `shell` enum('/bin/csh','/bin/sh','/sbin/nologin') NOT NULL DEFAULT '/sbin/nologin',
  `quota` varchar(255) NOT NULL,
  `account_note` varchar(255) NOT NULL,
  `birthday_date` date NOT NULL,
  `create_date` datetime NOT NULL,
  `update_date` datetime NOT NULL,
  PRIMARY KEY (`id_account`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- Дамп данных таблицы `accounts`
--

INSERT INTO `accounts` (`id_account`, `number_pass`, `id_status`, `id_samba_group`, `id_user_group`, `deleted`, `blocked`, `internet_lock`, `access_to_database`, `account_name`, `login`, `password`, `picture`, `shell`, `quota`, `account_note`, `birthday_date`, `create_date`, `update_date`) VALUES
(1, 13179, 1, 1, 1, 0, 'Нет', 'Нормальный доступ', 'Полный доступ', 'Копоть Володимир Володимирович', 'kopot_vv', '1', '', '', '0:0:0:0', '', '2011-06-01', '2011-06-26 00:00:00', '2011-06-26 00:46:56');

-- --------------------------------------------------------

--
-- Структура таблицы `last_events`
--

CREATE TABLE IF NOT EXISTS `last_events` (
  `id_last_event` int(11) NOT NULL AUTO_INCREMENT,
  `id_account` int(11) NOT NULL,
  `event_name` varchar(255) NOT NULL,
  `event_time` datetime NOT NULL,
  PRIMARY KEY (`id_last_event`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=14 ;

--
-- Дамп данных таблицы `last_events`
--

INSERT INTO `last_events` (`id_last_event`, `id_account`, `event_name`, `event_time`) VALUES
(1, 1, 'Login', '2011-06-30 09:17:24'),
(2, 1, 'Login', '2011-06-30 09:18:28'),
(3, 1, 'Login', '2011-06-30 09:50:42'),
(4, 1, 'Login', '2011-06-30 09:50:51'),
(5, 1, 'Login', '2011-06-30 10:20:59'),
(6, 1, 'Login', '2011-06-30 10:21:31'),
(7, 1, 'Login', '2011-06-30 15:47:57'),
(8, 1, 'Login', '2011-06-30 16:12:45'),
(9, 1, 'Login', '2011-06-30 16:13:37'),
(10, 1, 'Login', '2011-06-30 16:14:06'),
(11, 1, 'Login', '2011-06-30 16:15:11'),
(12, 1, 'Login', '2011-06-30 17:58:16'),
(13, 1, 'Login', '2011-07-01 09:26:24');

-- --------------------------------------------------------

--
-- Структура таблицы `samba_groups`
--

CREATE TABLE IF NOT EXISTS `samba_groups` (
  `id_samba_group` int(3) NOT NULL AUTO_INCREMENT,
  `samba_group_name` varchar(255) NOT NULL,
  `samba_group_note` varchar(255) NOT NULL,
  PRIMARY KEY (`id_samba_group`),
  UNIQUE KEY `id_samba_group` (`id_samba_group`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=74 ;

--
-- Дамп данных таблицы `samba_groups`
--

INSERT INTO `samba_groups` (`id_samba_group`, `samba_group_name`, `samba_group_note`) VALUES
(72, 'olympiad', 'olympiad'),
(71, 'jep', 'jep'),
(70, 'mje', 'mje'),
(69, 'pm', 'pm'),
(68, 'mk', 'mk'),
(67, 'kd', 'kd'),
(66, 'ocsis', 'ocsis'),
(65, 'p', 'p'),
(64, 'pgs', 'pgs'),
(63, 'm', 'm'),
(62, 'teachers', 'teachers'),
(61, 'no', 'no'),
(60, 'guest', 'guest'),
(59, 'ec', 'ec'),
(58, 'ep', 'ep'),
(57, 'me', 'me'),
(56, 'lyceum', 'lyceum'),
(55, 'ua', 'ua'),
(54, 'mo', 'mo'),
(53, 'csis', 'csis'),
(52, 'f', 'f'),
(51, 'wheel', 'wheel'),
(73, 'n', 'n');

-- --------------------------------------------------------

--
-- Структура таблицы `statuses`
--

CREATE TABLE IF NOT EXISTS `statuses` (
  `id_status` int(3) NOT NULL AUTO_INCREMENT,
  `status_name` varchar(255) NOT NULL,
  `status_note` varchar(255) NOT NULL,
  PRIMARY KEY (`id_status`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=7 ;

--
-- Дамп данных таблицы `statuses`
--

INSERT INTO `statuses` (`id_status`, `status_name`, `status_note`) VALUES
(4, 'преподаватель', 'преподаватель'),
(5, 'студент', 'студент'),
(6, 'ученик', 'ученик');

-- --------------------------------------------------------

--
-- Структура таблицы `user_groups`
--

CREATE TABLE IF NOT EXISTS `user_groups` (
  `id_user_group` int(5) NOT NULL AUTO_INCREMENT,
  `name_user_group` varchar(255) NOT NULL,
  `note_user_group` varchar(255) NOT NULL,
  PRIMARY KEY (`id_user_group`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=311 ;

--
-- Дамп данных таблицы `user_groups`
--

INSERT INTO `user_groups` (`id_user_group`, `name_user_group`, `note_user_group`) VALUES
(1, 'ФК-117', 'ФК-117'),
(2, '002', '002'),
(3, 'МО-127', 'МО-127'),
(4, 'УА-117', 'УА-117'),
(5, 'КСіМ-210', 'КСіМ-210'),
(6, 'ФН-117', 'ФН-117'),
(7, 'МЭ-110', 'МЭ-110'),
(8, 'МЭ-116', 'МЭ-116'),
(9, 'Ф-125', 'Ф-125'),
(10, 'МЭ-215', 'МЭ-215'),
(11, 'КСИС-116C', 'КСИС-116C'),
(12, 'ЭП-110К', 'ЭП-110К'),
(13, 'МО 617', 'МО 617'),
(14, 'МЭ-117', 'МЭ-117'),
(15, 'ЭП-215', 'ЭП-215'),
(16, 'Ф-226К', 'Ф-226К'),
(17, 'Ф-535', 'Ф-535'),
(18, 'Ф-110К', 'Ф-110К'),
(19, 'МК-117', 'МК-117'),
(20, 'КСиС-219', 'КСиС-219'),
(21, 'ФК-110К', 'ФК-110К'),
(22, 'КСиС-217', 'КСиС-217'),
(23, 'ЭП-228К', 'ЭП-228К'),
(24, 'ЭП -228к', 'ЭП -228к'),
(25, 'МК-128', 'МК-128'),
(26, 'Ф 216К', 'Ф 216К'),
(27, 'ЭП-128К', 'ЭП-128К'),
(28, 'ЭК 117', 'ЭК 117'),
(29, 'ЭП-417', 'ЭП-417'),
(30, 'АМ-117', 'АМ-117'),
(31, 'КСиС-918', 'КСиС-918'),
(32, 'Ф 226К', 'Ф 226К'),
(33, 'ОКСИС-110К', 'ОКСИС-110К'),
(34, 'П-117', 'П-117'),
(35, 'ПГС-817', 'ПГС-817'),
(36, 'ЭП-117', 'ЭП-117'),
(37, 'ОКСиС-110К', 'ОКСиС-110К'),
(38, 'ЭП-128', 'ЭП-128'),
(39, 'ЭП-228', 'ЭП-228'),
(40, 'Ф-116М', 'Ф-116М'),
(41, 'ЭП-236К', 'ЭП-236К'),
(42, 'ЭП 236К', 'ЭП 236К'),
(43, 'Ф-210К', 'Ф-210К'),
(44, 'КСиС-128', 'КСиС-128'),
(45, 'УА-218', 'УА-218'),
(46, 'П-116', 'П-116'),
(47, 'ЕП-236К', 'ЕП-236К'),
(48, 'КСиС-218', 'КСиС-218'),
(49, 'ФК-128', 'ФК-128'),
(50, 'П-119', 'П-119'),
(51, 'ПГС-117', 'ПГС-117'),
(52, 'ОКСИС-118К', 'ОКСИС-118К'),
(53, 'Ф-216', 'Ф-216'),
(54, 'ПГС-118', 'ПГС-118'),
(55, 'Ф 616', 'Ф 616'),
(56, 'МЭ-119', 'МЭ-119'),
(57, 'ЕП-115К', 'ЕП-115К'),
(58, 'ЕП 616', 'ЕП 616'),
(59, 'П-110', 'П-110'),
(60, 'Ф-116С', 'Ф-116С'),
(61, 'Курси', 'Курси'),
(62, 'П-317', 'П-317'),
(63, 'ЭП-416', 'ЭП-416'),
(64, 'БО-217К', 'БО-217К'),
(65, 'Ф-216К', 'Ф-216К'),
(66, 'ЭП-226', 'ЭП-226'),
(67, 'ФК-115', 'ФК-115'),
(68, '13773', '13773'),
(69, 'ЕП-226К', 'ЕП-226К'),
(70, 'КД-118', 'КД-118'),
(71, 'ММС-110', 'ММС-110'),
(72, 'П-226К', 'П-226К'),
(73, 'МО-110', 'МО-110'),
(74, 'ПГС-110', 'ПГС-110'),
(75, 'ЭП-126', 'ЭП-126'),
(76, 'КСиС-117', 'КСиС-117'),
(77, 'Игры расбрасывал', 'Игры расбрасывал'),
(78, 'КД-210К', 'КД-210К'),
(79, 'ЕП-210К', 'ЕП-210К'),
(80, 'ОКСіМ-120К', 'ОКСіМ-120К'),
(81, 'П-118', 'П-118'),
(82, 'МК-116', 'МК-116'),
(83, 'КД-117К', 'КД-117К'),
(84, 'Ф 236К', 'Ф 236К'),
(85, 'КСиС-119', 'КСиС-119'),
(86, 'ЭП-127', 'ЭП-127'),
(87, 'КСиС 225', 'КСиС 225'),
(88, 'ЭП 216К', 'ЭП 216К'),
(89, 'ЭП-216', 'ЭП-216'),
(90, 'ЭП 226К', 'ЭП 226К'),
(91, 'МК-217', 'МК-217'),
(92, 'УА-217', 'УА-217'),
(93, 'Ф-217', 'Ф-217'),
(94, 'Ф-215', 'Ф-215'),
(95, 'ЭП-216К', 'ЭП-216К'),
(96, 'КСиС 215', 'КСиС 215'),
(97, 'МО-213', 'МО-213'),
(98, 'МЭ-216', 'МЭ-216'),
(99, 'КСИС-317', 'КСИС-317'),
(100, 'КСИС-217', 'КСИС-217'),
(101, 'ЭП-217К', 'ЭП-217К'),
(102, 'Ф-222', 'Ф-222'),
(103, 'Ксис 216', 'Ксис 216'),
(104, 'Н-115', 'Н-115'),
(105, 'ЛОГОС', 'ЛОГОС'),
(106, 'ЭП-226К', 'ЭП-226К'),
(107, 'КСИС-513', 'КСИС-513'),
(108, 'ОКСИС-216', 'ОКСИС-216'),
(109, 'ЭП-119', 'ЭП-119'),
(110, 'Ф 215', 'Ф 215'),
(111, 'КСиС-216', 'КСиС-216'),
(112, 'МЭ 215', 'МЭ 215'),
(113, 'Ф-223', 'Ф-223'),
(114, 'КСиС 317', 'КСиС 317'),
(115, 'КСИС-117', 'КСИС-117'),
(116, 'КСИС-225', 'КСИС-225'),
(117, 'ФК-147', 'ФК-147'),
(118, 'ЭП-217', 'ЭП-217'),
(119, 'Ф-213', 'Ф-213'),
(120, 'КСиС', 'КСиС'),
(121, 'ЭП-227', 'ЭП-227'),
(122, 'КД-217', 'КД-217'),
(123, 'A-227', 'A-227'),
(124, 'Ф-227К', 'Ф-227К'),
(125, 'ОКСиС-119', 'ОКСиС-119'),
(126, 'ЭП-125', 'ЭП-125'),
(127, 'ФК-138', 'ФК-138'),
(128, 'МО-118', 'МО-118'),
(129, 'ПГС -118', 'ПГС -118'),
(130, 'ПГС - 118', 'ПГС - 118'),
(131, 'ЭП-116К', 'ЭП-116К'),
(132, '126', '126'),
(133, 'КСиС-116', 'КСиС-116'),
(134, 'ЭП-117К', 'ЭП-117К'),
(135, 'Ф-117', 'Ф-117'),
(136, 'ФК-228', 'ФК-228'),
(137, 'МЭ-118', 'МЭ-118'),
(138, 'ЭП-118К', 'ЭП-118К'),
(139, 'Ф-128К', 'Ф-128К'),
(140, '10779', '10779'),
(141, 'ЕК-117', 'ЕК-117'),
(142, 'Ф-118К', 'Ф-118К'),
(143, 'ЄП-118К', 'ЄП-118К'),
(144, 'КСиС-226', 'КСиС-226'),
(145, 'МЕУ-118', 'МЕУ-118'),
(146, 'ЕК-118', 'ЕК-118'),
(147, 'МО-217', 'МО-217'),
(148, 'ПГС-217', 'ПГС-217'),
(149, 'Лицей', 'Лицей'),
(150, 'КСИС-116К', 'КСИС-116К'),
(151, 'Ф-126', 'Ф-126'),
(152, 'ФК-217', 'ФК-217'),
(153, 'ФК-218', 'ФК-218'),
(154, 'Ф-627', 'Ф-627'),
(155, 'КД-118К', 'КД-118К'),
(156, 'КД-117', 'КД-117'),
(157, 'КСИС-226', 'КСИС-226'),
(158, 'Ф-237', 'Ф-237'),
(159, 'A-237', 'A-237'),
(160, 'МЄ-110', 'МЄ-110'),
(161, 'МЄ110', 'МЄ110'),
(162, 'МЕ-110', 'МЕ-110'),
(163, 'ОКСіМ-119К', 'ОКСіМ-119К'),
(164, 'КСіМ-110', 'КСіМ-110'),
(165, 'ЕП-110К', 'ЕП-110К'),
(166, 'КД-110К', 'КД-110К'),
(167, 'ЕК-110', 'ЕК-110'),
(168, 'Ф-217К', 'Ф-217К'),
(169, 'Ф-119К', 'Ф-119К'),
(170, 'КД-110', 'КД-110'),
(171, 'КД-119', 'КД-119'),
(172, 'Ф-110', 'Ф-110'),
(173, 'КСіМ-120', 'КСіМ-120'),
(174, 'Ф-136', 'Ф-136'),
(175, 'УА-128', 'УА-128'),
(176, 'УА-317', 'УА-317'),
(177, 'УА-127', 'УА-127'),
(178, 'УА-118', 'УА-118'),
(179, 'КСИС-118К', 'КСИС-118К'),
(180, 'МК-118', 'МК-118'),
(181, 'ЭП-118', 'ЭП-118'),
(182, 'КСіМ-219', 'КСіМ-219'),
(183, 'ЭП-116', 'ЭП-116'),
(184, 'ОКСИС-118', 'ОКСИС-118'),
(185, 'КД-217К', 'КД-217К'),
(186, 'МК-127', 'МК-127'),
(187, 'Ф-210', 'Ф-210'),
(188, 'Ф-237К', 'Ф-237К'),
(189, 'ФН-127', 'ФН-127'),
(190, 'КД-218К', 'КД-218К'),
(191, 'МО-317', 'МО-317'),
(192, 'МО-114', 'МО-114'),
(193, 'Ф-257', 'Ф-257'),
(194, 'КСИС-918', 'КСИС-918'),
(195, 'Ф-236М', 'Ф-236М'),
(196, 'КСИС-119К', 'КСИС-119К'),
(197, 'ФК - 119', 'ФК - 119'),
(198, 'ОКСИС-117К', 'ОКСИС-117К'),
(199, 'ЭК-718', 'ЭК-718'),
(200, 'ЭП-318', 'ЭП-318'),
(201, 'УА-318', 'УА-318'),
(202, 'БУ-217К', 'БУ-217К'),
(203, 'МО-318П', 'МО-318П'),
(204, 'КД-218к', 'КД-218к'),
(205, 'ЭК-118', 'ЭК-118'),
(206, 'ЭП-318п', 'ЭП-318п'),
(207, 'ЭП-218', 'ЭП-218'),
(208, 'МО-318п', 'МО-318п'),
(209, 'Ф-218К', 'Ф-218К'),
(210, 'КД-117к', 'КД-117к'),
(211, 'ЭП-218К', 'ЭП-218К'),
(212, 'ЭП-118к', 'ЭП-118к'),
(213, 'ЭК-217', 'ЭК-217'),
(214, 'КСиС - 525', 'КСиС - 525'),
(215, 'Ф-717', 'Ф-717'),
(216, 'МЭ', 'МЭ'),
(217, 'Ф-228', 'Ф-228'),
(218, 'КСИС', 'КСИС'),
(219, 'ЭП-114', 'ЭП-114'),
(220, 'Ф', 'Ф'),
(221, 'ФА-119', 'ФА-119'),
(222, 'МО-119', 'МО-119'),
(223, 'ПЦБ-217', 'ПЦБ-217'),
(224, 'УА-416К', 'УА-416К'),
(225, 'УА-416', 'УА-416'),
(226, 'Ф-416К', 'Ф-416К'),
(227, 'Ф-416', 'Ф-416'),
(228, 'П-217', 'П-217'),
(229, 'КСиС-717', 'КСиС-717'),
(230, 'Ф-515', 'Ф-515'),
(231, 'МО-424М', 'МО-424М'),
(232, 'ОКСиС-118К', 'ОКСиС-118К'),
(233, 'ЭК-119', 'ЭК-119'),
(234, 'МЭО-119', 'МЭО-119'),
(235, 'МЭУ-119', 'МЭУ-119'),
(236, 'МЕ-116', 'МЕ-116'),
(237, 'МО-216', 'МО-216'),
(238, 'МО-116', 'МО-116'),
(239, '04', '04'),
(240, 'ФК-119', 'ФК-119'),
(241, 'ОКСиС-116', 'ОКСиС-116'),
(242, 'КСИС-127', 'КСИС-127'),
(243, 'Ф-116К', 'Ф-116К'),
(244, 'Ф 316', 'Ф 316'),
(245, 'Ф-219К', 'Ф-219К'),
(246, 'МЭВ-110', 'МЭВ-110'),
(247, 'ОКСиС-119К', 'ОКСиС-119К'),
(248, 'wheel', 'wheel'),
(249, 'МО-117', 'МО-117'),
(250, 'Ф-226', 'Ф-226'),
(251, 'ОА-115М', 'ОА-115М'),
(252, 'МК-215', 'МК-215'),
(253, 'Ф-116м', 'Ф-116м'),
(254, 'ФК-118', 'ФК-118'),
(255, 'Ф-225', 'Ф-225'),
(256, 'Н-116', 'Н-116'),
(257, 'Ф - 225', 'Ф - 225'),
(258, 'Ф-115', 'Ф-115'),
(259, 'ОКСиС-118', 'ОКСиС-118'),
(260, 'МО-115', 'МО-115'),
(261, 'УА-119', 'УА-119'),
(262, 'МЭ - 119', 'МЭ - 119'),
(263, 'Ф-124', 'Ф-124'),
(264, 'КСИС-928', 'КСИС-928'),
(265, 'МЭ-217', 'МЭ-217'),
(266, 'Н-217', 'Н-217'),
(267, 'КСИС-310', 'КСИС-310'),
(268, 'Ф-126К', 'Ф-126К'),
(269, 'ЕП-219К', 'ЕП-219К'),
(270, 'Ф-117К', 'Ф-117К'),
(271, 'ОКСИС 114К', 'ОКСИС 114К'),
(272, 'КСиC-117', 'КСиC-117'),
(273, 'КСИС-116', 'КСИС-116'),
(274, 'Ф-310', 'Ф-310'),
(275, 'КСиС 116', 'КСиС 116'),
(276, 'МТС-117', 'МТС-117'),
(277, 'МЭУ - 119', 'МЭУ - 119'),
(278, 'ПГС - 119', 'ПГС - 119'),
(279, 'ОКСиС - 119К', 'ОКСиС - 119К'),
(280, 'ФК - 118', 'ФК - 118'),
(281, 'ФОКСиС-119', 'ФОКСиС-119'),
(282, 'Ф-524', 'Ф-524'),
(283, 'Ф - 218', 'Ф - 218'),
(284, 'ЭП-248К', 'ЭП-248К'),
(285, 'ЭП - 248к', 'ЭП - 248к'),
(286, 'ЭП-248', 'ЭП-248'),
(287, 'ФК-717', 'ФК-717'),
(288, 'ЭП-717', 'ЭП-717'),
(289, 'ЭП - 238К', 'ЭП - 238К'),
(290, 'Ф-238К', 'Ф-238К'),
(291, 'КД-218', 'КД-218'),
(292, 'Ф-248', 'Ф-248'),
(293, 'Ф-138', 'Ф-138'),
(294, 'МО-219', 'МО-219'),
(295, 'МК-219', 'МК-219'),
(296, 'ЭП-219', 'ЭП-219'),
(297, 'Ф-228К', 'Ф-228К'),
(298, 'ЭП- 218К', 'ЭП- 218К'),
(299, 'ОКСиС-120К', 'ОКСиС-120К'),
(300, 'ПГС-815', 'ПГС-815'),
(301, 'ПГС-816', 'ПГС-816'),
(302, 'КСиС-516', 'КСиС-516'),
(303, 'Ф-516', 'Ф-516'),
(304, 'МО-210', 'МО-210'),
(305, 'Ф-258К', 'Ф-258К'),
(306, 'ПГС-218', 'ПГС-218'),
(307, 'ЭП-238', 'ЭП-238'),
(308, 'Ф-716', 'Ф-716'),
(309, 'ЭП-415', 'ЭП-415'),
(310, 'Ф-417', 'Ф-417');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
